tnd-msa-sp-orqclientes0035/ORQClientes0035.wsdl

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="ORQClientes0035" targetNamespace="http://bpichincha.com/servicios" xmlns:bp="http://bpichincha.com/servicios" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <wsdl:documentation>
    <wsdl:appinfo source="WMQI_APPINFO">
      <MRWSDLAppInfo imported="true">
        <generatedXSD location="ORQClientes0035_InlineSchema1.xsd"/>
        <binding hasEncoding="false" imported="true" name="ORQClientes0035SOAP" originalBindingStyle="document"/>
      </MRWSDLAppInfo>
    </wsdl:appinfo>
  </wsdl:documentation>
  <wsdl:types>
    
          <xsd:schema targetNamespace="http://bpichincha.com/servicios" xmlns:ibmSchExtn="http://www.ibm.com/schema/extensions">
<xsd:include schemaLocation="ORQClientes0035_InlineSchema1.xsd"/>
    </xsd:schema>
    </wsdl:types>
  <wsdl:message name="CreacionCliente21Request">
    <wsdl:part element="bp:CreacionCliente21" name="parameters"/>
  </wsdl:message>
  <wsdl:message name="CreacionCliente21Response">
    <wsdl:part element="bp:CreacionCliente21Response" name="parameters"/>
  </wsdl:message>
  <wsdl:portType name="ORQClientes0035">
    <wsdl:operation name="CreacionCliente21">
      <wsdl:input message="bp:CreacionCliente21Request"/>
      <wsdl:output message="bp:CreacionCliente21Response"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="ORQClientes0035SOAP" type="bp:ORQClientes0035">

  	<soap:binding style="document"
  		transport="http://schemas.xmlsoap.org/soap/http" />
  	<wsdl:operation name="CreacionCliente21">

  		<soap:operation
  			soapAction="http://bpichincha.com/servicios/CreacionCliente21" />
  		<wsdl:input>

  			<soap:body use="literal" />
  		</wsdl:input>
  		<wsdl:output>

  			<soap:body use="literal" />
  		</wsdl:output>
  	</wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="ORQClientes0035">
    <wsdl:port binding="bp:ORQClientes0035SOAP" name="ORQClientes0035SOAP">
      <soap:address location="http://localhost:7800/IntegrationBus/soap/ORQClientes0035"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>